Revit 2027 API
BuiltInFailures.PerformanceFailures.TooLargeSketch Property
 Sketch of <element> has large area - it may slow down selection, drawing and geometric computations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooLargeSketch { get; }
Public Shared ReadOnly Property TooLargeSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooLargeSketch {
	FailureDefinitionId^ get ();
}
static member TooLargeSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace